WorksetId Property
 Get Id of the Workset which owns the element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public WorksetId WorksetId { get; }
  Visual Basic
Public ReadOnly Property WorksetId As WorksetId
	Get
  Visual C++
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
}
 Remarks
 Each element belongs to one and only one workset.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →